# Задание 3. Условный оператор
# Условие: Дано целое число. Если оно является положительным, то прибавить к нему 1;
# если отрицательным, то вычесть из него 2; если нулевым, то заменить его на 10.
# Вывести полученное число.

def main():
    print("=== Задание 3 (Условный оператор). Трёхвариантное ветвление ===")
    n = int(input("Введите целое число: "))
    
    # Полная ветвящаяся структура if - elif - else
    if n > 0:
        n += 1
    elif n < 0:
        n -= 2
    else:
        n = 10
    
    print(f"Полученное число: {n}")

if __name__ == "__main__":
    main()
