# Задание 4. Условный оператор
# Условие: Даны три целых числа. Найти количество положительных чисел в исходном наборе.

def main():
    print("=== Задание 4 (Условный оператор). Количество положительных чисел ===")
    a = int(input("Введите первое целое число: "))
    b = int(input("Введите второе целое число: "))
    c = int(input("Введите третье целое число: "))
    
    # Счетчик положительных чисел
    positive_count = 0
    
    if a > 0:
        positive_count += 1
    if b > 0:
        positive_count += 1
    if c > 0:
        positive_count += 1
    
    print(f"Количество положительных чисел: {positive_count}")

if __name__ == "__main__":
    main()
