# Задание 2. Условный оператор
# Условие: Дано целое число. Если оно является положительным, то прибавить к нему 1;
# в противном случае вычесть из него 2. Вывести полученное число.

def main():
    print("=== Задание 2 (Условный оператор). Двухвариантное изменение числа ===")
    n = int(input("Введите целое число: "))
    
    # Если число положительное, прибавляем 1; иначе вычитаем 2
    if n > 0:
        n += 1
    else:
        n -= 2
    
    print(f"Полученное число: {n}")

if __name__ == "__main__":
    main()
